app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-04 18:16:14.231189"], ["updated_at", "2018-09-04 18:16:14.231189"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-09-04 18:16:14.241186"], ["updated_at", "2018-09-04 18:16:14.241186"]]
---
  def upload
    CSV.foreach(params[:file].path, headres: true) do |song|
      Song.create(title: song[0], artist_name: song[1])